**`commonimages/base/rhel_6_10`** terragrunt plan on `push` event [#209](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["stig_rhel6_ansible.yml.tftpl"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["stig_rhel6_ansible.yml.tftpl"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/base-rhel-6-10-stig-rhel6-ansible/0.0.8/1"
        name                  = "base_rhel_6_10_stig_rhel6_ansible"
      + supported_os_versions = []
        tags                  = {
            "application"                               = "n/a"
            "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
            "branch"                                    = "main"
            "business-unit"                             = "HMPPS"
            "image-pipeline"                            = "base_rhel_6_10"
            "image-recipe"                              = "base_rhel_6_10/0.0.8"
            "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
            "is-production"                             = "true"
            "os-version"                                = "rhel 6.10"
            "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                          = "n/a"
            "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
            "update-linux-version"                      = "1.0.2"
        }
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-6-10" -> (known after apply)
      ~ date_created                     = "2023-03-17T10:11:58.651Z" -> (known after apply)
      + date_last_run                    = (known after apply)
      ~ date_next_run                    = "2023-05-01T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-03-17T10:11:58.651Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/base-rhel-6-10" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.0.8" -> (known after apply) # forces replacement
        name                             = "base_rhel_6_10"
      ~ platform                         = "Linux" -> (known after apply)
        tags                             = {
            "application"                               = "n/a"
            "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
            "branch"                                    = "main"
            "business-unit"                             = "HMPPS"
            "image-pipeline"                            = "base_rhel_6_10"
            "image-recipe"                              = "base_rhel_6_10/0.0.8"
            "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
            "is-production"                             = "true"
            "os-version"                                = "rhel 6.10"
            "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                          = "n/a"
            "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
            "update-linux-version"                      = "1.0.2"
        }
        # (6 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.0.8" -> (known after apply)
      ~ date_created     = "2023-03-17T10:11:57.090Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/base-rhel-6-10/0.0.8" -> (known after apply)
        name             = "base_rhel_6_10"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-095f71fce81c09b79" -> "ami-023a539e6d65fa54b" # forces replacement
      ~ platform         = "Linux" -> (known after apply)
        tags             = {
            "application"                               = "n/a"
            "base_rhel_6_10_stig_rhel6_ansible-version" = "0.0.8"
            "branch"                                    = "main"
            "business-unit"                             = "HMPPS"
            "image-pipeline"                            = "base_rhel_6_10"
            "image-recipe"                              = "base_rhel_6_10/0.0.8"
            "infrastructure-configuration"              = "base_rhel_6_10/0.0.8"
            "is-production"                             = "true"
            "os-version"                                = "rhel 6.10"
            "owner"                                     = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                          = "n/a"
            "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_6_10"
            "update-linux-version"                      = "1.0.2"
        }
        # (4 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```
